Employee Performance Prediction Dataset Analysis:

<u>Objectives of the project :</u> 
1. Load the dataset into a Pandas DataFrame and display the first 10 rows.
2. What are the column names and their respective data types in the dataset?
3. How many rows and columns are there in the dataset?
4. Select the Name, Age, and Salary columns using df[].
5. Select the first 5 rows of the DataFrame using the iloc method.
6. Select all rows where the Department is "Sales" using the loc method.
7. Select rows where the Salary is greater than 8000 and Status is "Active".
8. Extract the rows where the employee has been with the company for more than 5 years and has a Performance Score of at least 4.
9. Select every alternate row from the DataFrame using slicing with iloc.
10. Retrieve rows where the employee belongs to "Sales" and has a Salary in the top 10% of all salaries.
11. Replace all "Inactive" values in the Status column with "Retired".
12. Add a new column Bonus where values are 10% of the Salary column.
13. Update the Performance Score of employees in the "IT" department to 5 if it is NaN.
14. Modify the Experience of employees with less than 2 years to 2.
15. Normalize the Salary column so that all values are between 0 and 1.
16. Replace all Location values with "Remote" for employees with a Performance Score below 3.
17. Create a new column Experience Level with values "Junior", "Mid", or "Senior" based on the Experience.
18. Add a new row with specific values using the append() method.
19. Delete the column Session from the DataFrame.
20. Delete rows where the Age is greater than 60.
21. Add a new column Age Group with values "Young", "Middle-aged", or "Senior" based on Age.
22. Identify all columns with missing values using the isna() method.
23. Fill the missing values in Performance Score with the average score of that column.
24. Drop all rows with missing values using the dropna() method.
25. Replace missing values in Performance Score with the median of the scores, grouped by Department.
26. Identify rows where the employee is in the "IT" department and their Age is above the average Age of "IT" employees
27. Identify rows with duplicate Name and Joining Date combinations, and remove duplicates.
28. Remove rows where the Experience value is inconsistent with the Age (e.g., Experience > Age - 18).
29. Sort the DataFrame by Salary in descending order.
30. Sort the DataFrame by Department and then by Joining Date in ascending order.
31. Rank all employees by Salary within their Department and add the rank as a new column.
32. Sort the dataset by Experience in descending order, but break ties using Performance Score in ascending order.
33. Create a new DataFrame containing only employees in "HR" with a Salary above 5000.
34. Filter out all rows where the Location is "Chicago".
35. Delete all rows where the Performance Score is below 2.
36. Find the average Salary for each Department.
37. Calculate the total Salary of all employees grouped by Status.
38. Find the maximum Performance Score for employees in each Location.
39. Calculate the total Salary paid to employees who joined in each year.
40. Find the department with the highest average Performance Score.
41. Count the number of employees in each Location grouped by their Session.
42. Group employees by Status and calculate the sum, mean, and standard deviation of their Salary.
43. Use the apply() method to create a new column Monthly Salary by dividing the Salary by 12.
44. Use the applymap() method to convert all string values in the DataFrame to uppercase.
45. Create a second dataset containing Department and Budget. Perform an inner join with the original dataset.
46. Merge the dataset with another dataset that includes additional information about employee ID and their recent Projects.
47. Perform a left join with a dataset containing Department and Team Lead details, adding Team Lead to the DataFrame.
48. Create a DataFrame with employee ID and Project Count, then merge it with the original dataset. Calculate the average Salary per project.
49. Calculate the percentage increase in Salary for each employee compared to the average Salary in their department.

In [377]:
df = pd.read_csv("Employe_Performance_dataset.csv")

In [378]:
# 1. Display the first 10 rows
print(df.head(10))

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR    5641   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2   3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3   4  Christine Williams   58  Female         IT    5895   2017-09-08
4   5        Amber Harris   35   Other         IT    4317   2020-02-15
5   6         Ashley Howe   29  Female         HR    2591   2016-06-24
6   7         David Olson   39  Female      Sales    6826   2023-05-11
7   8        Amanda Baker   52   Other         HR    6285   2015-04-01
8   9       Jeremy Wright   63  Female      Sales    9862   2024-02-07
9  10      Brian Faulkner   30    Male         IT    8202   2018-05-26

   Performance Score  Experience    Status     Location  Session
0                2.0          16    Active     New York    Night
1                2.0          11  Inactive  Los Angeles  Evening
2                NaN           1  Inactive     New York  Morning
3                2.0          13  Inactive  Los Angeles  Evening
4                5.0          16  Inactive     New York  Evening
5                1.0           6    Active      Chicago  Evening
6                NaN           4    Active     New York    Night
7                NaN           8  Inactive      Chicago  Evening
8                NaN           3  Inactive     New York    Night
9                1.0           9    Active  Los Angeles  Morning

In [379]:
# 2. Column names and data types
print(df.dtypes)

ID                     int64
Name                  object
Age                    int64
Gender                object
Department            object
Salary                 int64
Joining Date          object
Performance Score    float64
Experience             int64
Status                object
Location              object
Session               object
dtype: object

In [380]:
# 3. Shape of dataset (rows and columns)
print("Rows and Columns:", df.shape)

Rows and Columns: (1000, 12)

In [381]:
# 4. Select Name, Age, Salary columns
print(df[["Name", "Age", "Salary"]])

                   Name  Age  Salary
0          Cory Escobar   48    5641
1       Timothy Sanchez   25    4249
2          Chad Nichols   57    3058
3    Christine Williams   58    5895
4          Amber Harris   35    4317
..                  ...  ...     ...
995       Pamela Reeves   49    7652
996        Todd Johnson   29    6754
997     Michael Sanchez   18    5278
998       Ashley Taylor   51    5437
999         Shawn Scott   45    7364

[1000 rows x 3 columns]

In [382]:
# 5. First 5 rows using iloc
print(df.iloc[:5])

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR    5641   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2   3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3   4  Christine Williams   58  Female         IT    5895   2017-09-08
4   5        Amber Harris   35   Other         IT    4317   2020-02-15

   Performance Score  Experience    Status     Location  Session
0                2.0          16    Active     New York    Night
1                2.0          11  Inactive  Los Angeles  Evening
2                NaN           1  Inactive     New York  Morning
3                2.0          13  Inactive  Los Angeles  Evening
4                5.0          16  Inactive     New York  Evening

In [383]:
# 6. Rows where Department is "Sales" using loc
print(df.loc[df["Department"] == "Sales"])

      ID             Name  Age  Gender Department  Salary Joining Date  \
1      2  Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2      3     Chad Nichols   57   Other      Sales    3058   2019-02-12
6      7      David Olson   39  Female      Sales    6826   2023-05-11
8      9    Jeremy Wright   63  Female      Sales    9862   2024-02-07
10    11      Nicole Bell   42  Female      Sales    5336   2015-01-28
..   ...              ...  ...     ...        ...     ...          ...
991  992  William Schultz   23   Other      Sales    4311   2019-08-17
992  993   Ashley Daniels   25   Other      Sales    5524   2022-11-24
995  996    Pamela Reeves   49  Female      Sales    7652   2024-06-23
996  997     Todd Johnson   29  Female      Sales    6754   2018-07-20
997  998  Michael Sanchez   18    Male      Sales    5278   2023-07-05

     Performance Score  Experience    Status     Location  Session
1                  2.0          11  Inactive  Los Angeles  Evening
2                  NaN           1  Inactive     New York  Morning
6                  NaN           4    Active     New York    Night
8                  NaN           3  Inactive     New York    Night
10                 3.0           7    Active  Los Angeles  Evening
..                 ...         ...       ...          ...      ...
991                NaN          10  Inactive  Los Angeles  Evening
992                NaN           8  Inactive     New York  Morning
995                4.0           3    Active  Los Angeles  Evening
996                NaN          12  Inactive     New York  Morning
997                5.0           3    Active     New York  Morning

[338 rows x 12 columns]

In [384]:
# 7. Salary > 8000 and Status is "Active"
print(df[(df["Salary"] > 8000) & (df["Status"] == "Active")])

      ID             Name  Age  Gender Department  Salary Joining Date  \
9     10   Brian Faulkner   30    Male         IT    8202   2018-05-26
24    25    Tracy Carlson   21    Male         HR    9275   2022-04-09
38    39     Jordan Scott   33   Other      Sales    8678   2016-05-15
39    40      Lisa Wagner   36    Male         HR    8870   2024-08-12
60    61   Andrew Shannon   51   Other      Sales    8544   2020-02-08
..   ...              ...  ...     ...        ...     ...          ...
976  977    Kimberly Ross   19    Male      Sales    9331   2018-07-03
982  983    Stephen Ponce   46   Other      Sales    8696   2022-10-14
986  987  Melissa Bradley   39  Female         IT    9618   2015-07-05
988  989   Hannah Hickman   36  Female         IT    9118   2022-07-02
989  990    Shannon Meyer   18   Other         HR    9985   2022-11-05

     Performance Score  Experience  Status     Location  Session
9                  1.0           9  Active  Los Angeles  Morning
24                 4.0          12  Active     New York  Morning
38                 5.0           9  Active  Los Angeles  Evening
39                 4.0          17  Active  Los Angeles  Evening
60                 NaN           6  Active     New York  Evening
..                 ...         ...     ...          ...      ...
976                5.0          12  Active     New York  Morning
982                4.0           1  Active     New York  Evening
986                1.0          13  Active     New York  Morning
988                5.0           5  Active     New York    Night
989                4.0          18  Active      Chicago    Night

[112 rows x 12 columns]

In [385]:
# 8. Experience > 5 and Performance Score ≥ 4
print(df[(df["Experience"] > 5) & (df["Performance Score"] >= 4)])

      ID                Name  Age  Gender Department  Salary Joining Date  \
4      5        Amber Harris   35   Other         IT    4317   2020-02-15
11    12   Rodney Richardson   60   Other         HR    6908   2015-03-14
17    18  Jacqueline Randall   31  Female         HR    3519   2018-05-18
18    19      Nancy Stephens   38    Male         HR    9061   2017-07-16
24    25       Tracy Carlson   21    Male         HR    9275   2022-04-09
..   ...                 ...  ...     ...        ...     ...          ...
978  979         Michael Lee   18  Female         IT    6086   2019-05-30
989  990       Shannon Meyer   18   Other         HR    9985   2022-11-05
990  991        Amy Johnston   53  Female         HR    3991   2024-09-03
993  994       Brandon Bruce   31  Female         HR    3371   2018-09-25
998  999       Ashley Taylor   51  Female         IT    5437   2022-02-18

     Performance Score  Experience    Status     Location  Session
4                  5.0          16  Inactive     New York  Evening
11                 4.0          19    Active      Chicago    Night
17                 4.0           6    Active     New York  Morning
18                 5.0          16  Inactive      Chicago    Night
24                 4.0          12    Active     New York  Morning
..                 ...         ...       ...          ...      ...
978                4.0           7  Inactive  Los Angeles  Evening
989                4.0          18    Active      Chicago    Night
990                4.0           8    Active      Chicago  Morning
993                5.0          12  Inactive      Chicago    Night
998                4.0           9  Inactive  Los Angeles  Evening

[137 rows x 12 columns]

In [386]:
# 9. Every alternate row using iloc slicing
print(df.iloc[::2])

      ID             Name  Age  Gender Department  Salary Joining Date  \
0      1     Cory Escobar   48  Female         HR    5641   2015-05-03
2      3     Chad Nichols   57   Other      Sales    3058   2019-02-12
4      5     Amber Harris   35   Other         IT    4317   2020-02-15
6      7      David Olson   39  Female      Sales    6826   2023-05-11
8      9    Jeremy Wright   63  Female      Sales    9862   2024-02-07
..   ...              ...  ...     ...        ...     ...          ...
990  991     Amy Johnston   53  Female         HR    3991   2024-09-03
992  993   Ashley Daniels   25   Other      Sales    5524   2022-11-24
994  995  Rachel Phillips   22    Male         IT    3096   2018-10-27
996  997     Todd Johnson   29  Female      Sales    6754   2018-07-20
998  999    Ashley Taylor   51  Female         IT    5437   2022-02-18

     Performance Score  Experience    Status     Location  Session
0                  2.0          16    Active     New York    Night
2                  NaN           1  Inactive     New York  Morning
4                  5.0          16  Inactive     New York  Evening
6                  NaN           4    Active     New York    Night
8                  NaN           3  Inactive     New York    Night
..                 ...         ...       ...          ...      ...
990                4.0           8    Active      Chicago  Morning
992                NaN           8  Inactive     New York  Morning
994                2.0           7  Inactive      Chicago  Evening
996                NaN          12  Inactive     New York  Morning
998                4.0           9  Inactive  Los Angeles  Evening

[500 rows x 12 columns]

In [387]:
# 10. "Sales" department and top 10% salary
threshold = df["Salary"].quantile(0.90)
print(df[(df["Department"] == "Sales") & (df["Salary"] >= threshold)])

      ID                     Name  Age  Gender Department  Salary  \
8      9            Jeremy Wright   63  Female      Sales    9862
22    23             Bryce Carter   35  Female      Sales    9598
29    30            Rachel Ramsey   22    Male      Sales    9661
215  216               Sara Jones   50  Female      Sales    9377
228  229          Christie Warren   51  Female      Sales    9139
239  240      Christina Gutierrez   37    Male      Sales    9356
250  251           Joshua Bullock   38    Male      Sales    9924
263  264          Gabriela Wilson   40   Other      Sales    9455
275  276          Harry Alexander   22    Male      Sales    9749
299  300              Terry Smith   38  Female      Sales    9375
379  380                Dustin Le   29    Male      Sales    9726
381  382           David Marshall   43   Other      Sales    9269
405  406            Heather Scott   57    Male      Sales    9505
442  443          Kimberly Sparks   26   Other      Sales    9146
491  492  Dr. Jacob Castaneda DVM   53   Other      Sales    9181
516  517           Christina Lowe   35  Female      Sales    9630
552  553          Amanda Griffith   26    Male      Sales    9704
591  592          Jonathan Rangel   49   Other      Sales    9323
594  595           Michelle Smith   35   Other      Sales    9906
629  630           Patricia Scott   52   Other      Sales    9364
742  743           Timothy Guzman   41  Female      Sales    9409
756  757              James James   38    Male      Sales    9666
758  759          Matthew Roberts   53    Male      Sales    9917
778  779             David Nelson   39   Other      Sales    9653
796  797            Jacob Shannon   35   Other      Sales    9926
844  845             Gerald Cooke   33   Other      Sales    9693
898  899           Tiffany Jordan   44    Male      Sales    9819
903  904             Leslie Mason   42   Other      Sales    9658
932  933             Kristin Cole   50    Male      Sales    9616
937  938            Gary Mitchell   52  Female      Sales    9963
976  977            Kimberly Ross   19    Male      Sales    9331

    Joining Date  Performance Score  Experience    Status     Location  \
8     2024-02-07                NaN           3  Inactive     New York
22    2015-12-16                4.0           4  Inactive     New York
29    2016-08-18                2.0          17  Inactive      Chicago
215   2019-10-16                NaN           3    Active  Los Angeles
228   2020-08-16                5.0           1    Active      Chicago
239   2018-01-02                3.0           3    Active      Chicago
250   2019-01-10                4.0          20  Inactive      Chicago
263   2023-11-19                1.0          14    Active  Los Angeles
275   2019-05-15                NaN           5    Active  Los Angeles
299   2022-12-23                NaN           2  Inactive     New York
379   2015-04-13                1.0           2  Inactive      Chicago
381   2018-10-05                2.0          13  Inactive  Los Angeles
405   2024-08-18                3.0           6  Inactive     New York
442   2024-07-29                3.0           3  Inactive     New York
491   2024-02-17                5.0           1  Inactive  Los Angeles
516   2018-07-03                NaN           1    Active  Los Angeles
552   2019-05-30                NaN           9    Active     New York
591   2021-01-19                NaN          18  Inactive      Chicago
594   2018-12-18                NaN           9    Active  Los Angeles
629   2019-11-05                NaN           5    Active     New York
742   2023-09-17                NaN          16  Inactive     New York
756   2016-04-14                NaN          15    Active  Los Angeles
758   2017-07-07                1.0          16    Active  Los Angeles
778   2021-08-08                NaN          19  Inactive     New York
796   2016-09-04                NaN           7    Active      Chicago
844   2017-08-29                NaN          17  Inactive     New York
898   2022-07-15                NaN          13    Active     New York
903   2019-10-31                1.0          14  Inactive     New York
932   2017-02-03                2.0          13  Inactive  Los Angeles
937   2016-09-22                5.0          20  Inactive  Los Angeles
976   2018-07-03                5.0          12    Active     New York

     Session
8      Night
22     Night
29     Night
215  Morning
228    Night
239  Morning
250    Night
263  Morning
275  Morning
299  Morning
379  Evening
381  Evening
405    Night
442  Evening
491  Morning
516    Night
552  Evening
591  Evening
594  Evening
629  Evening
742  Morning
756  Morning
758  Evening
778  Morning
796    Night
844  Morning
898  Morning
903  Evening
932    Night
937  Morning
976  Morning

In [388]:
# 11. Replace "Inactive" with "Retired"
df["Status"] = df["Status"].replace("Inactive", "Retired")
print("\nUpdated Status column:\n", df["Status"].value_counts())

Updated Status column:
 Status
Active     501
Retired    499
Name: count, dtype: int64

In [389]:
# 12. Add Bonus column (10% of Salary)
df["Bonus"] = df["Salary"] * 0.10
print("\n Bonus column:\n", df[["Name", "Salary", "Bonus"]].head())

 Bonus column:
                  Name  Salary  Bonus
0        Cory Escobar    5641  564.1
1     Timothy Sanchez    4249  424.9
2        Chad Nichols    3058  305.8
3  Christine Williams    5895  589.5
4        Amber Harris    4317  431.7

In [390]:
# 13. Update NaN Performance Score in IT to 5
df.loc[(df["Department"] == "IT") & (df["Performance Score"].isna()), "Performance Score"] = 5
print("\nPerformance Score after filling NaN in IT:\n", df[df["Department"] == "IT"]["Performance Score"].head())

Performance Score after filling NaN in IT:
 3     2.0
4     5.0
9     1.0
12    5.0
13    5.0
Name: Performance Score, dtype: float64

In [391]:
# 14. Set Experience < 2 to 2
df.loc[df["Experience"] < 2, "Experience"] = 2
print("\nExperience column after modification:\n", df["Experience"].head())

Experience column after modification:
 0    16
1    11
2     2
3    13
4    16
Name: Experience, dtype: int64

In [392]:
# 15. Normalize Salary
df["Salary_Normalized"] = (df["Salary"] - df["Salary"].min()) / (df["Salary"].max() - df["Salary"].min())
print("\nNormalized Salary:\n", df[["Salary", "Salary_Normalized"]].head())

Normalized Salary:
    Salary  Salary_Normalized
0    5641           0.454500
1    4249           0.280020
2    3058           0.130735
3    5895           0.486337
4    4317           0.288543

In [393]:
# 16. Location -> Remote if Perf Score < 3
df.loc[df["Performance Score"] < 3, "Location"] = "Remote"
print("\nUpdated Location where Perf Score < 3:\n", df[["Name", "Performance Score", "Location"]].head())

Updated Location where Perf Score < 3:
                  Name  Performance Score  Location
0        Cory Escobar                2.0    Remote
1     Timothy Sanchez                2.0    Remote
2        Chad Nichols                NaN  New York
3  Christine Williams                2.0    Remote
4        Amber Harris                5.0  New York

In [394]:
# 17. Experience Level column
def experience_level(exp):
    if exp < 5:
        return "Junior"
    elif exp < 15:
        return "Mid"
    else:
        return "Senior"
df["Experience Level"] = df["Experience"].apply(experience_level)
print("\nExperience Level column:\n", df[["Experience", "Experience Level"]].head())

Experience Level column:
    Experience Experience Level
0          16           Senior
1          11              Mid
2           2           Junior
3          13              Mid
4          16           Senior

In [395]:
# 18. Add a new row
new_row = {
    "ID": 999, "Name": "John Doe", "Age": 40, "Gender": "Male", "Department": "HR",
    "Salary": 7000, "Joining Date": "2022-01-01", "Performance Score": 4,
    "Experience": 10, "Status": "Active", "Location": "Remote", "Session": "Morning"
}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)
print("\nNew row added. Last 1 row:\n", df.tail(1))

New row added. Last 1 row:
        ID      Name  Age Gender Department  Salary Joining Date  \
1000  999  John Doe   40   Male         HR    7000   2022-01-01

      Performance Score  Experience  Status Location  Session  Bonus  \
1000                4.0          10  Active   Remote  Morning    NaN

      Salary_Normalized Experience Level
1000                NaN              NaN

In [396]:
# 19. Delete Session column
df.drop("Session", axis=1, inplace=True)
print("\nColumns after dropping 'Session':\n", df.columns)

Columns after dropping 'Session':
 Index(['ID', 'Name', 'Age', 'Gender', 'Department', 'Salary', 'Joining Date',
       'Performance Score', 'Experience', 'Status', 'Location', 'Bonus',
       'Salary_Normalized', 'Experience Level'],
      dtype='object')

In [397]:
# 20. Delete rows where Age > 60
df = df[df["Age"] <= 60]
print("\nRows after removing Age > 60:\n", df.shape)

Rows after removing Age > 60:
 (894, 14)

In [398]:
# 21. Age Group column
def age_group(age):
    if age < 30:
        return "Young"
    elif age < 50:
        return "Middle-aged"
    else:
        return "Senior"
df["Age Group"] = df["Age"].apply(age_group)
print("\nAge Group column:\n", df[["Age", "Age Group"]].head())

Age Group column:
    Age    Age Group
0   48  Middle-aged
1   25        Young
2   57       Senior
3   58       Senior
4   35  Middle-aged

In [399]:
# 22. Missing values
print("\nColumns with missing values:\n", df.isna().sum())

Columns with missing values:
 ID                     0
Name                   0
Age                    0
Gender                 0
Department             0
Salary                 0
Joining Date           0
Performance Score    291
Experience             0
Status                 0
Location               0
Bonus                  1
Salary_Normalized      1
Experience Level       1
Age Group              0
dtype: int64

In [400]:
# 23. Fill missing Performance Score with mean
df["Performance Score"].fillna(df["Performance Score"].mean(), inplace=True)
print("\nFilled missing Performance Score with mean.")

Filled missing Performance Score with mean.

C:\Users\Dhairya\AppData\Local\Temp\ipykernel_1152\2982166079.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Performance Score"].fillna(df["Performance Score"].mean(), inplace=True)

In [401]:
# 24. Drop all rows with any missing values
df_cleaned = df.dropna()
print("\nShape after dropping rows with NaNs:", df_cleaned.shape)

Shape after dropping rows with NaNs: (893, 15)

In [402]:
# 25. Fill Performance Score by department median
df["Performance Score"] = df.groupby("Department")["Performance Score"].transform(lambda x: x.fillna(x.median()))
print("\nPerformance Score filled with department median.")

Performance Score filled with department median.

In [403]:
# 26. IT and Age above avg
avg_age_it = df[df["Department"] == "IT"]["Age"].mean()
print("\nIT employees above avg age:\n", df[(df["Department"] == "IT") & (df["Age"] > avg_age_it)])

IT employees above avg age:
        ID                Name  Age  Gender Department  Salary Joining Date  \
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
33     34    Mr. Brian Nelson   42  Female         IT    5207   2017-08-17
34     35            Lisa Fry   51  Female         IT    9259   2017-09-26
41     42      Charles Mccall   58   Other         IT    9512   2024-11-10
47     48        Jake Johnson   48   Other         IT    5848   2017-02-03
..    ...                 ...  ...     ...        ...     ...          ...
979   980    Crystal Espinoza   55  Female         IT    4952   2023-09-04
984   985        Jeffrey Hall   41   Other         IT    8768   2018-08-27
986   987     Melissa Bradley   39  Female         IT    9618   2015-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Bonus  \
3                  2.0          13  Retired       Remote  589.5
33                 1.0           4   Active       Remote  520.7
34                 4.0          17  Retired  Los Angeles  925.9
41                 5.0           8  Retired  Los Angeles  951.2
47                 3.0           2   Active  Los Angeles  584.8
..                 ...         ...      ...          ...    ...
979                2.0           5   Active       Remote  495.2
984                3.0          16  Retired  Los Angeles  876.8
986                1.0          13   Active       Remote  961.8
998                4.0           9  Retired  Los Angeles  543.7
999                2.0           4   Active       Remote  736.4

     Salary_Normalized Experience Level    Age Group
3             0.486337              Mid       Senior
33            0.400100           Junior  Middle-aged
34            0.907997           Senior       Senior
41            0.939709              Mid       Senior
47            0.480446           Junior  Middle-aged
..                 ...              ...          ...
979           0.368137              Mid       Senior
984           0.846453           Senior  Middle-aged
986           0.952996              Mid  Middle-aged
998           0.428930              Mid       Senior
999           0.670469           Junior  Middle-aged

[150 rows x 15 columns]

In [404]:
# 27. Remove duplicate Name + Joining Date
df.drop_duplicates(subset=["Name", "Joining Date"], inplace=True)
print("\nRemoved duplicates based on Name and Joining Date.")

Removed duplicates based on Name and Joining Date.

In [405]:
# 28. Remove rows where Experience > Age - 18
df = df[df["Experience"] <= (df["Age"] - 18)]
print("\nRemoved rows with inconsistent Experience.")

Removed rows with inconsistent Experience.

In [406]:
# 29. Sort by Salary descending
df_sorted_salary = df.sort_values(by="Salary", ascending=False)
print("\n29. Top 5 highest salaries:\n", df_sorted_salary[["Name", "Salary"]].head())

29. Top 5 highest salaries:
                    Name  Salary
811        Jesse Miller    9993
531  Jeffrey Williamson    9988
937       Gary Mitchell    9963
908       Sara Martinez    9951
120       David Hampton    9941

In [407]:
# 30. Sort by Department, Joining Date
df_sorted_dept_date = df.sort_values(by=["Department", "Joining Date"])
print("\nSorted by Department and Joining Date:\n", df_sorted_dept_date[["Department", "Joining Date"]].head())

Sorted by Department and Joining Date:
     Department Joining Date
514         HR   2015-03-10
11          HR   2015-03-14
7           HR   2015-04-01
677         HR   2015-04-25
0           HR   2015-05-03

In [408]:
# 31. Salary rank within Department
df["Salary Rank"] = df.groupby("Department")["Salary"].rank(ascending=False)
print("\nSalary Rank within Department:\n", df[["Department", "Salary", "Salary Rank"]].head())

Salary Rank within Department:
   Department  Salary  Salary Rank
0         HR    5641        115.0
2      Sales    3058        191.0
3         IT    5895        109.0
4         IT    4317        159.0
5         HR    2591        196.0

In [409]:
# 32. Sort by Experience desc, Performance Score asc
df_sorted_exp_perf = df.sort_values(by=["Experience", "Performance Score"], ascending=[False, True])
print("\nSorted by Experience & Perf Score:\n", df_sorted_exp_perf[["Experience", "Performance Score"]].head())

Sorted by Experience & Perf Score:
      Experience  Performance Score
355          20                1.0
402          20                1.0
538          20                1.0
828          20                1.0
529          20                2.0

In [410]:
# 33. HR with Salary > 5000
df_hr_5000 = df[(df["Department"] == "HR") & (df["Salary"] > 5000)]
print("\nHR employees with Salary > 5000:\n", df_hr_5000)

HR employees with Salary > 5000:
        ID               Name  Age  Gender Department  Salary Joining Date  \
0       1       Cory Escobar   48  Female         HR    5641   2015-05-03
7       8       Amanda Baker   52   Other         HR    6285   2015-04-01
11     12  Rodney Richardson   60   Other         HR    6908   2015-03-14
16     17     Jonathan Perez   59    Male         HR    6586   2019-02-19
18     19     Nancy Stephens   38    Male         HR    9061   2017-07-16
...   ...                ...  ...     ...        ...     ...          ...
944   945     Mary Armstrong   29  Female         HR    9402   2017-12-13
953   954       Ruth Osborne   53    Male         HR    5616   2022-07-31
958   959     Morgan Coleman   51  Female         HR    6415   2022-03-20
983   984        David Moody   43    Male         HR    8830   2021-09-10
1000  999           John Doe   40    Male         HR    7000   2022-01-01

      Performance Score  Experience   Status     Location  Bonus  \
0              2.000000          16   Active       Remote  564.1
7              3.442786           8  Retired      Chicago  628.5
11             4.000000          19   Active      Chicago  690.8
16             3.000000           7  Retired  Los Angeles  658.6
18             5.000000          16  Retired      Chicago  906.1
...                 ...         ...      ...          ...    ...
944            3.442786           2   Active     New York  940.2
953            4.000000          16   Active  Los Angeles  561.6
958            1.000000           8  Retired       Remote  641.5
983            3.442786          19  Retired      Chicago  883.0
1000           4.000000          10   Active       Remote    NaN

      Salary_Normalized Experience Level    Age Group  Salary Rank
0              0.454500           Senior  Middle-aged        115.0
7              0.535222              Mid       Senior        104.0
11             0.613312           Senior       Senior         82.0
16             0.572951              Mid       Senior         94.0
18             0.883179           Senior  Middle-aged         20.0
...                 ...              ...          ...          ...
944            0.925921           Junior        Young         12.0
953            0.451366           Senior       Senior        116.0
958            0.551517              Mid       Senior        100.0
983            0.854224           Senior  Middle-aged         25.0
1000                NaN              NaN  Middle-aged         78.0

[129 rows x 16 columns]

In [411]:
# 34. Filter out Location = Chicago
df = df[df["Location"] != "Chicago"]
print("\nData after filtering out Chicago:\n", df.shape)

Data after filtering out Chicago:
 (493, 16)

In [412]:
# 35. Remove rows where Perf Score < 2
df = df[df["Performance Score"] >= 2]
print("\nRemoved rows with Performance Score < 2:", df.shape)

Removed rows with Performance Score < 2: (418, 16)

In [413]:
# 36. Avg Salary per Department
print("\nAvg Salary per Department:\n", df.groupby("Department")["Salary"].mean())

Avg Salary per Department:
 Department
HR       5997.584000
IT       5814.593548
Sales    5940.811594
Name: Salary, dtype: float64

In [414]:
# 37. Total Salary by Status
print("\nTotal Salary by Status:\n", df.groupby("Status")["Salary"].sum())

Total Salary by Status:
 Status
Active     1213997
Retired    1256795
Name: Salary, dtype: int64

In [415]:
# 38. Max Perf Score per Location
print("\nMax Perf Score per Location:\n", df.groupby("Location")["Performance Score"].max())

Max Perf Score per Location:
 Location
Los Angeles    5.0
New York       5.0
Remote         4.0
Name: Performance Score, dtype: float64

In [416]:
# 39. Total salary per Joining Year
df["Joining Year"] = pd.to_datetime(df["Joining Date"]).dt.year
print("\nTotal salary by Joining Year:\n", df.groupby("Joining Year")["Salary"].sum())

Total salary by Joining Year:
 Joining Year
2014     15135
2015    183612
2016    224542
2017    229453
2018    328109
2019    239013
2020    213576
2021    263590
2022    223888
2023    296657
2024    253217
Name: Salary, dtype: int64

In [417]:
# 40. Department with highest avg Perf Score
print("\nDept with highest avg Performance Score:", df.groupby("Department")["Performance Score"].mean().idxmax())

Dept with highest avg Performance Score: IT

In [418]:
# 41. Count of employees in each Location by Session
#Session doesn't exist

In [419]:
# 42. Salary stats by Status
print("\nSalary stats by Status:\n", df.groupby("Status")["Salary"].agg(["sum", "mean", "std"]))

Salary stats by Status:
              sum         mean          std
Status
Active   1213997  5864.719807  2352.411444
Retired  1256795  5956.374408  2334.318738

In [420]:
# 43. Monthly Salary using apply
df["Monthly Salary"] = df["Salary"].apply(lambda x: x / 12)
print("\nMonthly Salary:\n", df[["Name", "Monthly Salary"]].head())

Monthly Salary:
                  Name  Monthly Salary
0        Cory Escobar      470.083333
2        Chad Nichols      254.833333
3  Christine Williams      491.250000
4        Amber Harris      359.750000
6         David Olson      568.833333

In [421]:
# 44. applymap to convert all strings to uppercase
df_upper = df.applymap(lambda x: x.upper() if type(x) == str else x)
print("\nUppercased string values:\n", df_upper.head())

Uppercased string values:
    ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        CORY ESCOBAR   48  FEMALE         HR    5641   2015-05-03
2   3        CHAD NICHOLS   57   OTHER      SALES    3058   2019-02-12
3   4  CHRISTINE WILLIAMS   58  FEMALE         IT    5895   2017-09-08
4   5        AMBER HARRIS   35   OTHER         IT    4317   2020-02-15
6   7         DAVID OLSON   39  FEMALE      SALES    6826   2023-05-11

   Performance Score  Experience   Status  Location  Bonus  Salary_Normalized  \
0           2.000000          16   ACTIVE    REMOTE  564.1           0.454500
2           3.442786           2  RETIRED  NEW YORK  305.8           0.130735
3           2.000000          13  RETIRED    REMOTE  589.5           0.486337
4           5.000000          16  RETIRED  NEW YORK  431.7           0.288543
6           3.442786           4   ACTIVE  NEW YORK  682.6           0.603033

  Experience Level    Age Group  Salary Rank  Joining Year  Monthly Salary
0           SENIOR  MIDDLE-AGED        115.0          2015      470.083333
2           JUNIOR       SENIOR        191.0          2019      254.833333
3              MID       SENIOR        109.0          2017      491.250000
4           SENIOR  MIDDLE-AGED        159.0          2020      359.750000
6           JUNIOR  MIDDLE-AGED         90.0          2023      568.833333

C:\Users\Dhairya\AppData\Local\Temp\ipykernel_1152\3310511903.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_upper = df.applymap(lambda x: x.upper() if type(x) == str else x)

In [422]:
# 45. Inner join with Dept-Budget
dept_budget = pd.DataFrame({"Department": ["HR", "IT", "Sales"], "Budget": [100000, 150000, 120000]})
df_joined = pd.merge(df, dept_budget, on="Department", how="inner")
print("\nMerged with department budget:\n", df_joined[["Department", "Budget"]].drop_duplicates())

Merged with department budget:
   Department  Budget
0         HR  100000
1      Sales  120000
2         IT  150000

In [423]:
# 46. Merge with project info
project_data = pd.DataFrame({"ID": df["ID"].sample(frac=1.0).values, "Recent Projects": np.random.choice(["A", "B", "C"], size=len(df))})
df = pd.merge(df, project_data, on="ID", how="left")
print("\nAdded Recent Projects column:\n", df[["ID", "Recent Projects"]].head())

Added Recent Projects column:
    ID Recent Projects
0   1               B
1   3               B
2   4               A
3   5               A
4   7               B

In [424]:
# 47. Left join with Team Lead
tls = pd.DataFrame({"Department": ["HR", "IT", "Sales"], "Team Lead": ["Alice", "Bob", "Carol"]})
df = pd.merge(df, tls, on="Department", how="left")
print("\nAdded Team Lead info:\n", df[["Department", "Team Lead"]].drop_duplicates())

Added Team Lead info:
   Department Team Lead
0         HR     Alice
1      Sales     Carol
2         IT       Bob

In [425]:
# 48. Merge Project Count & Salary per Project
proj_counts = pd.DataFrame({"ID": df["ID"], "Project Count": np.random.randint(1, 6, size=len(df))})
df = pd.merge(df, proj_counts, on="ID", how="left")
df["Salary per Project"] = df["Salary"] / df["Project Count"]
print("\nSalary per Project:\n", df[["Name", "Project Count", "Salary per Project"]].head())

Salary per Project:
                  Name  Project Count  Salary per Project
0        Cory Escobar              5              1128.2
1        Chad Nichols              5               611.6
2  Christine Williams              2              2947.5
3        Amber Harris              2              2158.5
4         David Olson              4              1706.5

In [426]:
# 49. Salary % increase vs dept average
dept_avg_salary = df.groupby("Department")["Salary"].transform("mean")
df["Salary % Increase"] = ((df["Salary"] - dept_avg_salary) / dept_avg_salary) * 100
print("\nSalary % Increase vs Dept Avg:\n", df[["Name", "Department", "Salary", "Salary % Increase"]].head())

Salary % Increase vs Dept Avg:
                  Name Department  Salary  Salary % Increase
0        Cory Escobar         HR    5641          -6.771771
1        Chad Nichols      Sales    3058         -48.525552
2  Christine Williams         IT    5895           1.668120
3        Amber Harris         IT    4317         -25.546858
4         David Olson      Sales    6826          14.900126

In [427]:
print("Project Completed. Final DataFrame shape:", df.shape)

Project Completed. Final DataFrame shape: (432, 23)

Key Insights:

- The dataset revealed clear trends based on salary distribution, performance scores, experience, and departmental roles.
- Employees in the Sales and IT departments generally had higher salary ranks, and top performers were consistently assigned higher bonuses.
- Experience and performance scores were positively correlated, and bonus calculations allowed us to quantify high-performers across the organization.
- By using techniques like normalization, grouping, ranking, and advanced filtering (e.g., top 10% earners), we were able to generate insights useful for strategic HR decisions.